# Делу — время, потехе — час
# Давайте передохнём от автоматизации и сделаем что-то действительно интересное.

# Формат ввода
# Одно натуральное число N

# Формат вывода
# N строк с фразой: "Купи слона!"

a = int(input())
print('Купи слона!\n' * a)
