# Наказание
# Наше развлечение не осталось незамеченным...
# И наказание нам выбрали соответствующее.

# Формат ввода
# В первой строке записано одно натуральное число N
# Во второй строке записана часть наказания.

# Формат вывода
# N строк вида: Я больше никогда не буду писать "<часть наказания>"!

a = int(input())
b = input()
print(f'Я больше никогда не буду писать "{b}"!\n' * a)
